zephyrproject-rtos/hal_microchip/include/dt-bindings/sam/sam_d5x_e5x/same54/atsame54n19a-pinctrl.h
/* pb13a_eic_extint13 */
#define PB13A_EIC_EXTINT13 MCHP_PINMUX(b, 13, a, periph)

/* pb13b_adc0_x27 */
#define PB13B_ADC0_X27 MCHP_PINMUX(b, 13, b, periph)

/* pb13b_adc0_y27 */
#define PB13B_ADC0_Y27 MCHP_PINMUX(b, 13, b, periph)

/* pb13c_sercom4_pad1 */
#define PB13C_SERCOM4_PAD1 MCHP_PINMUX(b, 13, c, periph)

/* pb13e_tc4_wo1 */
#define PB13E_TC4_WO1 MCHP_PINMUX(b, 13, e, periph)

/* pb13f_tcc3_wo1 */
#define PB13F_TCC3_WO1 MCHP_PINMUX(b, 13, f, periph)

/* pb13g_tcc0_wo1 */
#define PB13G_TCC0_WO1 MCHP_PINMUX(b, 13, g, periph)

/* pb13h_can1_rx */
#define PB13H_CAN1_RX MCHP_PINMUX(b, 13, h, periph)

/* pb13i_sdhc0_sdwp */
#define PB13I_SDHC0_SDWP MCHP_PINMUX(b, 13, i, periph)

/* pb13j_i2s_mck1 */
#define PB13J_I2S_MCK1 MCHP_PINMUX(b, 13, j, periph)

/* pb13m_gclk_io7 */
#define PB13M_GCLK_IO7 MCHP_PINMUX(b, 13, m, periph)

/* pb14_gpio */
#define PB14_GPIO MCHP_PINMUX(b, 14, gpio, gpio)

/* pb14a_eic_extint14 */
#define PB14A_EIC_EXTINT14 MCHP_PINMUX(b, 14, a, periph)

/* pb14b_adc0_x28 */
#define PB14B_ADC0_X28 MCHP_PINMUX(b, 14, b, periph)

/* pb14b_adc0_y28 */
#define PB14B_ADC0_Y28 MCHP_PINMUX(b, 14, b, periph)

/* pb14c_sercom4_pad2 */
#define PB14C_SERCOM4_PAD2 MCHP_PINMUX(b, 14, c, periph)

/* pb14e_tc5_wo0 */
#define PB14E_TC5_WO0 MCHP_PINMUX(b, 14, e, periph)

/* pb14f_tcc4_wo0 */
#define PB14F_TCC4_WO0 MCHP_PINMUX(b, 14, f, periph)

/* pb14g_tcc0_wo2 */
#define PB14G_TCC0_WO2 MCHP_PINMUX(b, 14, g, periph)

/* pb14h_can1_tx */
#define PB14H_CAN1_TX MCHP_PINMUX(b, 14, h, periph)

/* pb14k_pcc_data8 */
#define PB14K_PCC_DATA8 MCHP_PINMUX(b, 14, k, periph)

/* pb14l_gmac_gmdc */
#define PB14L_GMAC_GMDC MCHP_PINMUX(b, 14, l, periph)

/* pb14m_gclk_io0 */
#define PB14M_GCLK_IO0 MCHP_PINMUX(b, 14, m, periph)

/* pb14n_ccl_in9 */
#define PB14N_CCL_IN9 MCHP_PINMUX(b, 14, n, periph)

/* pb15_gpio */
#define PB15_GPIO MCHP_PINMUX(b, 15, gpio, gpio)

/* pb15a_eic_extint15 */
#define PB15A_EIC_EXTINT15 MCHP_PINMUX(b, 15, a, periph)

/* pb15b_adc0_x29 */
#define PB15B_ADC0_X29 MCHP_PINMUX(b, 15, b, periph)

/* pb15b_adc0_y29 */
#define PB15B_ADC0_Y29 MCHP_PINMUX(b, 15, b, periph)

/* pb15c_sercom4_pad3 */
#define PB15C_SERCOM4_PAD3 MCHP_PINMUX(b, 15, c, periph)

/* pb15e_tc5_wo1 */
#define PB15E_TC5_WO1 MCHP_PINMUX(b, 15, e, periph)

/* pb15f_tcc4_wo1 */
#define PB15F_TCC4_WO1 MCHP_PINMUX(b, 15, f, periph)

/* pb15g_tcc0_wo3 */
#define PB15G_TCC0_WO3 MCHP_PINMUX(b, 15, g, periph)

/* pb15h_can1_rx */
#define PB15H_CAN1_RX MCHP_PINMUX(b, 15, h, periph)

/* pb15k_pcc_data9 */
#define PB15K_PCC_DATA9 MCHP_PINMUX(b, 15, k, periph)

/* pb15l_gmac_gmdio */
#define PB15L_GMAC_GMDIO MCHP_PINMUX(b, 15, l, periph)

/* pb15m_gclk_io1 */
#define PB15M_GCLK_IO1 MCHP_PINMUX(b, 15, m, periph)

/* pb15n_ccl_in10 */
#define PB15N_CCL_IN10 MCHP_PINMUX(b, 15, n, periph)

/* pb16_gpio */
#define PB16_GPIO MCHP_PINMUX(b, 16, gpio, gpio)

/* pb16a_eic_extint0 */
#define PB16A_EIC_EXTINT0 MCHP_PINMUX(b, 16, a, periph)

/* pb16c_sercom5_pad0 */
#define PB16C_SERCOM5_PAD0 MCHP_PINMUX(b, 16, c, periph)

/* pb16e_tc6_wo0 */
#define PB16E_TC6_WO0 MCHP_PINMUX(b, 16, e, periph)

/* pb16f_tcc3_wo0 */
#define PB16F_TCC3_WO0 MCHP_PINMUX(b, 16, f, periph)

/* pb16g_tcc0_wo4 */
#define PB16G_TCC0_WO4 MCHP_PINMUX(b, 16, g, periph)

/* pb16i_sdhc1_sdcd */
#define PB16I_SDHC1_SDCD MCHP_PINMUX(b, 16, i, periph)

/* pb16j_i2s_sck0 */
#define PB16J_I2S_SCK0 MCHP_PINMUX(b, 16, j, periph)

/* pb16m_gclk_io2 */
#define PB16M_GCLK_IO2 MCHP_PINMUX(b, 16, m, periph)

/* pb16n_ccl_in11 */
#define PB16N_CCL_IN11 MCHP_PINMUX(b, 16, n, periph)

/* pb17_gpio */
#define PB17_GPIO MCHP_PINMUX(b, 17, gpio, gpio)

/* pb17a_eic_extint1 */
#define PB17A_EIC_EXTINT1 MCHP_PINMUX(b, 17, a, periph)

/* pb17c_sercom5_pad1 */
#define PB17C_SERCOM5_PAD1 MCHP_PINMUX(b, 17, c, periph)

/* pb17e_tc6_wo1 */
#define PB17E_TC6_WO1 MCHP_PINMUX(b, 17, e, periph)

/* pb17f_tcc3_wo1 */
#define PB17F_TCC3_WO1 MCHP_PINMUX(b, 17, f, periph)

/* pb17g_tcc0_wo5 */
#define PB17G_TCC0_WO5 MCHP_PINMUX(b, 17, g, periph)

/* pb17i_sdhc1_sdwp */
#define PB17I_SDHC1_SDWP MCHP_PINMUX(b, 17, i, periph)

/* pb17j_i2s_mck0 */
#define PB17J_I2S_MCK0 MCHP_PINMUX(b, 17, j, periph)

/* pb17m_gclk_io3 */
#define PB17M_GCLK_IO3 MCHP_PINMUX(b, 17, m, periph)

/* pb17n_ccl_out3 */
#define PB17N_CCL_OUT3 MCHP_PINMUX(b, 17, n, periph)

/* pb18_gpio */
#define PB18_GPIO MCHP_PINMUX(b, 18, gpio, gpio)

/* pb18a_eic_extint2 */
#define PB18A_EIC_EXTINT2 MCHP_PINMUX(b, 18, a, periph)

/* pb18c_sercom5_pad2 */
#define PB18C_SERCOM5_PAD2 MCHP_PINMUX(b, 18, c, periph)

/* pb18d_sercom7_pad2 */
#define PB18D_SERCOM7_PAD2 MCHP_PINMUX(b, 18, d, periph)

/* pb18f_tcc1_wo0 */
#define PB18F_TCC1_WO0 MCHP_PINMUX(b, 18, f, periph)

/* pb18g_pdec_qdi0 */
#define PB18G_PDEC_QDI0 MCHP_PINMUX(b, 18, g, periph)

/* pb18i_sdhc1_sddat0 */
#define PB18I_SDHC1_SDDAT0 MCHP_PINMUX(b, 18, i, periph)

/* pb18m_gclk_io4 */
#define PB18M_GCLK_IO4 MCHP_PINMUX(b, 18, m, periph)

/* pb19_gpio */
#define PB19_GPIO MCHP_PINMUX(b, 19, gpio, gpio)

/* pb19a_eic_extint3 */
#define PB19A_EIC_EXTINT3 MCHP_PINMUX(b, 19, a, periph)

/* pb19c_sercom5_pad3 */
#define PB19C_SERCOM5_PAD3 MCHP_PINMUX(b, 19, c, periph)

/* pb19d_sercom7_pad3 */
#define PB19D_SERCOM7_PAD3 MCHP_PINMUX(b, 19, d, periph)

/* pb19f_tcc1_wo1 */
#define PB19F_TCC1_WO1 MCHP_PINMUX(b, 19, f, periph)

/* pb19g_pdec_qdi1 */
#define PB19G_PDEC_QDI1 MCHP_PINMUX(b, 19, g, periph)

/* pb19i_sdhc1_sddat1 */
#define PB19I_SDHC1_SDDAT1 MCHP_PINMUX(b, 19, i, periph)

/* pb19m_gclk_io5 */
#define PB19M_GCLK_IO5 MCHP_PINMUX(b, 19, m, periph)

/* pb20_gpio */
#define PB20_GPIO MCHP_PINMUX(b, 20, gpio, gpio)

/* pb20a_eic_extint4 */
#define PB20A_EIC_EXTINT4 MCHP_PINMUX(b, 20, a, periph)

/* pb20c_sercom3_pad0 */
#define PB20C_SERCOM3_PAD0 MCHP_PINMUX(b, 20, c, periph)

/* pb20d_sercom7_pad1 */
#define PB20D_SERCOM7_PAD1 MCHP_PINMUX(b, 20, d, periph)

/* pb20f_tcc1_wo2 */
#define PB20F_TCC1_WO2 MCHP_PINMUX(b, 20, f, periph)

/* pb20g_pdec_qdi2 */
#define PB20G_PDEC_QDI2 MCHP_PINMUX(b, 20, g, periph)

